[
  {
    "id": 1,
    "author": "honyaki",
    "tags": ["Научно-популярное", "Физика"],
    "title": "Откуда берётся квантовая неопределённость?",
    "description": "Даже такой простой объект, как атом, проявляет квантовую неопределённость. Если спросить, «где отдельный электрон находится прямо сейчас?», ответ можно дать лишь с определённой, ограниченной точностью. Как бы мы ни совершенствовали своё измерительное оборудование, отдельные квантовые свойства остаются в известной мере неопределёнными. Догадываетесь, почему? Подробности — к старту нашего флагманского курса по Data Science."
  },
  {
    "id": 2,
    "author": "someid",
    "tags": ["Карьера в IT-индустрии", "Статистика в IT", "Удалённая работа"],
    "title": "Что с IT рынком труда РФ? Графики",
    "description": "Рынок труда существенно изменился с начала года. Множество компаний в спешке переносили свои офисы за границу и этот процесс всё ещё продолжается. Мне стало интересно - на сколько изменился IT рынок труда в РФ из-за релокации компаний и программистов, и чтобы это выяснить я сделал небольшое исследование с графиками. Откуда это взялось? Для получения данных я запилил скрипт, который собрал статистику по IT рынку. Если точнее - собрал количество вакансий и резюме по каждому языку программирования(из моей выборки) с одного известного сайта вакансий. Это позволило оценить динамику количества вакансий и резюме и уровень конкуренции на каждом из направлений."
  },
  {
    "id": 3,
    "author": "qmzik",
    "tags": ["CSS", "JavaScript", "HTML"],
    "title": "Что нового можем делать с формами?",
    "description": "Браузеры постоянно добавляют новые функции HTML, JavaScript и CSS. Вот несколько полезных дополнений к работе с формами, которые вы могли пропустить. Safari 16 стал последним браузером, в котором была добавлена поддержка requestSubmit. Прежде чем мы рассмотрим, как работает requestSubmit, давайте напомним себе, как программная отправка формы с помощью JavaScript работает при использовании метода submit()."
  },
  {
    "id": 4,
    "author": "monreve",
    "tags": ["Блог компании", "Производство и разработка электроники"],
    "title": "Старое, новое, электронное: собираем ретро-гаджеты из современных компонентов",
    "description": "Стоимость устройства составляет всего $25, за эту цену покупатель получает девайс, способный воспроизводить лишь одну игру — и ту 30-летней давности. Само устройство, несмотря на то, что выполнено из современных компонентов, выглядит, как артефакт прошлых лет. Угловатый толстый корпус, небольшой дисплей, крупные кнопки — все это намеренно производит впечатление прошлых десятилетий. Даже вырез под динамик выглядит соответствующим образом. Есть даже имитация дисковода для гибких дисков. К сожалению, эта имитация нерабочая. Работает устройство либо от сети, либо от трех АА-батареек. Все, как и раньше. Игра, которая зашита в памяти — не шутер, конечно, а старая обучающая квестовая игрушка, которая заставляет думать."
  },
  {
    "id": 5,
    "author": "justDeveloper",
    "tags": ["Программирование", "Solidity", "Криптовалюты"],
    "title": "Руководство по AccessControl от OpenZeppelin",
    "description": "Сегодня поговорим про такой полезный инструмент как AccessControl от OpenZeppelin, данная библиотека позволит вам регулировать доступ к разного рода функционалу на ваших умных контрактах и не только. Вы сможете объявлять роли, присваивать эти роли другим пользователям и даже назначать роли для адресов, которые будут назначать другие роли. Это невероятный, гибкий и простой инструмент, с которым должен быть знаком каждый разработчик умных контрактов. А теперь к делу!"
  }
]